app/views/tracks/index.html.erb


  <% @tracks.includes(:album).each do |track| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" IN ($1, $2, $3)  [["id", 4], ["id", 5], ["id", 2]]