app/controllers/albums_controller.rb

  def index
    @albums = Album.all
---
SELECT "albums".* FROM "albums"

  def show
    @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def new
    @album = Album.new
    @bands = Band.all
---
SELECT "bands".* FROM "bands"

  def create
    @album = Album.new(album_params)

    if @album.save
---
INSERT INTO "albums" ("title", "year", "band_id", "created_at", "updated_at", "studio") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Hello There Stupid"], ["year", 2018], ["band_id", 1], ["created_at", "2019-05-13 14:21:29.674138"], ["updated_at", "2019-05-13 14:21:29.674138"], ["studio", false]]

  def edit
    @album = Album.find(params[:id])
    @bands = Band.all
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "bands".* FROM "bands"

  def update
    @album = Album.find(params[:id])

    if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "year" = $2, "band_id" = $3, "studio" = $4, "updated_at" = $5 WHERE "albums"."id" = $6  [["title", "Hello There"], ["year", 2003], ["band_id", 1], ["studio", true], ["updated_at", "2019-05-13 18:23:29.114799"], ["id", 4]]

  def destroy
    @album = Album.find(params[:id])

    if @album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 2]]