app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "npqPLL8JzFJYGWqZemGBdQ"], ["LIMIT", 1]]
---
  def current_user
    user ||= User.find_by(session_token: self.session[:session_token])