app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 2]]
---
  def show
    @band = Band.find(params[:id])
    @albums = Album.where(band_id: params[:id])