app/controllers/notes_controller.rb

  def create
    @note = Note.new(note_params)
    @track = Track.find(params[:track_id])
    @note.user_id = current_user.id
    @note.track_id = @track.id
    if @note.save
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
INSERT INTO "notes" ("user_id", "track_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5], ["track_id", 12], ["body", "testing 1 2 3"], ["created_at", "2019-05-18 17:03:18.150131"], ["updated_at", "2019-05-18 17:03:18.150131"]]

  def edit
    @note = Note.find(params[:id])
    @track = Track.find(params[:track_id])
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @note = Note.find(params[:id])
    @track = Track.find(params[:track_id])
    if @note.update(note_params)
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "notes" SET "body" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["body", "testing 1 2 3 4\r\n"], ["updated_at", "2019-05-18 18:35:19.262679"], ["id", 1]]

  def destroy
    @note = Note.find(params[:id])
    @track = Track.find(params[:track_id])
    if current_user.id == @note.user_id
      if @note.destroy
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 2]]