app/controllers/tracks_controller.rb

SELECT "tracks".* FROM "tracks"
---
  def index
    @tracks = Track.all

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "notes".* FROM "notes"
---
  def show
    @track = Track.find(params[:id])
    @notes = Note.all

SELECT "albums".* FROM "albums"
---
  def new
    @track = Track.new()
    @album_id = params[:album_id]
    @albums = Album.all

SELECT "albums".* FROM "albums"
INSERT INTO "tracks" ("album_id", "title", "ord", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["album_id", 1], ["title", "track 1"], ["ord", 1], ["lyrics", " Lyrics not provided."], ["created_at", "2019-05-17 17:00:40.406096"], ["updated_at", "2019-05-17 17:00:40.406096"]]
---
  def create
    @track = Track.new(track_params)
    @album_id = params[:album_id]
    @albums = Album.all

    if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "albums".* FROM "albums"
---
  def edit
    @track = Track.find(params[:id])
    @album_id = params[:album_id]
    @albums = Album.all

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "tracks" SET "album_id" = $1, "lyrics" = $2, "updated_at" = $3 WHERE "tracks"."id" = $4
---
  def update
    @track = Track.find(params[:id])
    @album_id = params[:album_id]
    @albums = Album.all

    if @track.update(track_params)

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 8]]
---
  def destroy
    @track = Track.find(params[:id])

    if @track.destroy