app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "repYhS6F-pOnCLj0OLy2qw"], ["updated_at", "2019-05-10 14:21:56.764224"], ["id", 4]]
---
  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save